; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v7 - type_2 ?v4 - type_3)
 	      (pred_2 ?v3 - object ?v4 - type_3)
	      (pred_4 ?v7 - type_2 ?v5 - type_1)
	      (pred_1 ?v7 - type_2 ?v3 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v7 - type_2 ?v1 ?v6 - type_3)
       :precondition (and  (pred_3 ?v7 ?v1))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v1))))

   (:action op_1
       :parameters (?v7 - type_2 ?v8 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v2) (pred_3 ?v7 ?v2) (pred_4 ?v7 ?v5))
       :effect (and (pred_1 ?v7 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v2)) 
		    (not (pred_4 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_2 ?v8 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v8 ?v5) (pred_3 ?v7 ?v2))
       :effect (and (pred_2 ?v8 ?v2)
		    (pred_4 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_10 - type_2
obj_07 obj_03 obj_11 obj_08 - type_1
obj_02 obj_01 obj_06 obj_05 - type_3
obj_09 obj_13 obj_12 - object)
(:init
(pred_3 obj_04 obj_05)
(pred_4 obj_04 obj_07)
(pred_4 obj_04 obj_03)
(pred_3 obj_10 obj_01)
(pred_4 obj_10 obj_11)
(pred_4 obj_10 obj_08)
(pred_2 obj_09 obj_06)
(pred_2 obj_13 obj_02)
(pred_2 obj_12 obj_06)
)
(:goal
(and
(pred_2 obj_09 obj_01)
(pred_2 obj_13 obj_06)
(pred_2 obj_12 obj_02)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_06)))
)
)

; plan
1. (op_3 obj_04 obj_05 obj_01)
   deleted: (pred_3 obj_04 obj_05)
   added: (pred_3 obj_04 obj_01)
   goals met: 0 of 3
2. (op_3 obj_10 obj_01 obj_02)
   deleted: (pred_3 obj_10 obj_01)
   added: (pred_3 obj_10 obj_02)
   goals met: 0 of 3
3. (op_1 obj_10 obj_13 obj_02 obj_08)
   deleted: (pred_2 obj_13 obj_02) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_13 obj_08)
   goals met: 0 of 3
4. (op_3 obj_10 obj_02 obj_06)
   deleted: (pred_3 obj_10 obj_02)
   added: (pred_3 obj_10 obj_06)
   goals met: 0 of 3
5. (op_2 obj_10 obj_13 obj_06 obj_08)
   deleted: (pred_1 obj_10 obj_13 obj_08)
   added: (pred_2 obj_13 obj_06) (pred_4 obj_10 obj_08)
   goals met: 1 of 3
6. (op_1 obj_10 obj_12 obj_06 obj_08)
   deleted: (pred_2 obj_12 obj_06) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_12 obj_08)
   goals met: 1 of 3
7. (op_3 obj_10 obj_06 obj_02)
   deleted: (pred_3 obj_10 obj_06)
   added: (pred_3 obj_10 obj_02)
   goals met: 1 of 3
8. (op_2 obj_10 obj_12 obj_02 obj_08)
   deleted: (pred_1 obj_10 obj_12 obj_08)
   added: (pred_2 obj_12 obj_02) (pred_4 obj_10 obj_08)
   goals met: 2 of 3
9. (op_3 obj_10 obj_02 obj_06)
   deleted: (pred_3 obj_10 obj_02)
   added: (pred_3 obj_10 obj_06)
   goals met: 2 of 3
10. (op_1 obj_10 obj_09 obj_06 obj_08)
   deleted: (pred_2 obj_09 obj_06) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_09 obj_08)
   goals met: 2 of 3
11. (op_3 obj_10 obj_06 obj_01)
   deleted: (pred_3 obj_10 obj_06)
   added: (pred_3 obj_10 obj_01)
   goals met: 2 of 3
12. (op_2 obj_10 obj_09 obj_01 obj_08)
   deleted: (pred_1 obj_10 obj_09 obj_08)
   added: (pred_2 obj_09 obj_01) (pred_4 obj_10 obj_08)
   goals met: 3 of 3
